app/views/people/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."person_id" = ?  [["person_id", 1]]
---
       <% @people.each do |person| %>
       <% tasks = Task.where(person_id: person.id) %>