app/views/people/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."person_id" = ?  [["person_id", 1]]
---
  <li>Description: <%= @person.email %></li>
  <li>Unfinished Tasks: <%=Task.where(person_id: @person.id, completed_at: nil).length%></li>