task-list/app/controllers/home_controller.rb

  def index
    @all_tasks = Task.all
---
SELECT "tasks".* FROM "tasks"