task-list/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "go to park"], ["description", "play"], ["person_id", 2], ["created_at", "2016-04-26 02:25:17.413778"], ["updated_at", "2016-04-26 02:25:17.413778"]]
---
  def create
    @task = Task.create(task_create_params[:task])

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    Task.find(params[:id]).destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 17]]
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2016-04-26 01:20:43.952971"], ["updated_at", "2016-04-26 01:20:43.953471"], ["id", 17]]
---
  def complete
    Task.find(params[:id]).update({completed_at: Time.now})

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2016-04-26 01:00:50.383595"], ["updated_at", "2016-04-26 01:00:50.392493"], ["id", 12]]
---
  def update
    Task.find(params[:id]).update(task_create_params[:task])