task-list/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed_at" IS NULL
---
  def index
    @all_tasks = Task.all.where('completed_at IS NULL')