app/controllers/home_controller.rb

SELECT "tasks".* FROM "tasks"  ORDER BY "tasks"."id" ASC
---
  def index
    @tasks = Task.order(id: :asc)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  ORDER BY "tasks"."id" ASC  [["id", 1]]
---
  def by_task
   @task = Task.where(id: params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  ORDER BY "tasks"."id" ASC  [["id", 1]]
---
  def show
    @task = Task.find(params[:id])