app/controllers/people_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."person_id" = ?  [["person_id", 1]]
---
  def show
    @person = Person.find(params[:id])  # have this available in your index.html
    @tasks = Task.where(person_id: @person.id)