app/controllers/tasks_controller.rb

  def delete
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 16]]