app/controllers/tasks_controller.rb

  def index
    @tasks = Task.order(id: :asc)
---
SELECT "tasks".* FROM "tasks"  ORDER BY "tasks"."id" ASC

  def show
    # = is assigning          # accessing
    # @tasks = Task.where(id: params[:id]).order(id: :asc)

    # where returns an array that can have more then one element
    # find returns one instance of the class
    # will throw ActiveRecord::RecordNotFound: Couldn't find Task with 'id'=500
    @tasks = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  ORDER BY "tasks"."id" ASC LIMIT 1  [["id", 11]]

  def create
    @task = Task.new(task_create_params[:task]) #instantiate a new task
    if @task.save  #save returns true if the database insert succeeds
---
INSERT INTO "tasks" ("name", "description", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "jump"], ["description", "now"], ["person_id", 1], ["created_at", "2016-04-24 21:16:34.712742"], ["updated_at", "2016-04-24 21:16:34.712742"]]

  def update
    # assigning the value of id to an instance @task
    @task = Task.find(params[:id])
    if @task.update_attributes(task_edit_params[:task])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "call mom"], ["description", "okay test this"], ["updated_at", "2016-04-26 20:01:41.286041"], ["id", 8]]

  def destroy
    @task = Task.where(id: params[:id])
    @task.destroy_all
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]

    task = Task.find(params[:id])
    task.completed_at = t
    task.completion_status = "done"
      if task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2016-04-21 23:26:47.887531"], ["updated_at", "2016-04-21 23:26:47.891412"], ["id", 4]]