task-list/app/views/people/index.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."person_id" = ? AND "tasks"."completed_at" IS NULL  [["person_id", 1]]
---
 <li><%= link_to person.name, person_path(person.id) %></li>
    <p> uncompleted tasks: <%= person.tasks.where(completed_at: nil).count %> </p> <%#count is a rails method, not a ruby method! %>